InformationRegisters/ГрафикРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГрафикРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипГрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыГрафиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаГода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГрафикРаботы/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьОбновитьГрафик();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОбновитьГрафик(Очистить=Ложь)

	Перем ТипГрафика1;
	Если ЗначениеЗаполнено(ТипГрафика) Тогда
	Иначе
		
		Если ВвестиЗначение(ТипГрафика1, "Выберите график", Тип("СправочникСсылка.ТипыГрафиков")) Тогда
			ТипГрафика=ТипГрафика1;
			
		КонецЕсли; 
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТипГрафика) Тогда
		ЗаполнитьГрафик(ТипГрафика, ДатаГрафика,Очистить);
	Иначе
		Сообщить("Укажите тип графика");
	КонецЕсли; 
	Элементы.Список.Обновить();
	

КонецПроцедуры // ЗаполнитьОбновитьГрафик()
 

&НаСервереБезКонтекста
Процедура ЗаполнитьГрафик(ТипГрафика, ДатаГрафика,Очистить)
	ДатаНачалаГода = НачалоГода(ДатаГрафика);

	Набор = РегистрыСведений.ГрафикРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.ТипГрафика.Установить(ТипГрафика);
	Набор.Отбор.ДатаНачалаГода.Установить(ДатаНачалаГода);
	
	Если Очистить Тогда
	Иначе
		
		ВидГрафика = ТипГрафика.ВидГрафика ;
		ТекДата = НачалоГода(ДатаГрафика);
		КонецГода = КонецГода(ДатаГрафика);
		Пока ТекДата<=КонецГода Цикл
			Запись = Набор.Добавить();
			Запись.Дата = ТекДата;
			Запись.ДатаНачалаГода = ДатаНачалаГода;
			Запись.ТипГрафика = ТипГрафика;
			Если ВидГрафика = 1 Тогда
				
				Если ДеньНедели(ТекДата)<=5 Тогда
					Запись.Значение = 8;
				КонецЕсли; 
			ИначеЕсли ВидГрафика = 2 Тогда
				
				Если ДеньНедели(ТекДата)<=6 Тогда
					Запись.Значение = 8;
				КонецЕсли; 
				
			КонецЕсли; 
			
			ТекДата = ТекДата+24*3600;
		КонецЦикла;
		
		
	КонецЕсли; 
	Набор.Записать();
	

КонецПроцедуры // ЗаполнитьГрафик()

&НаКлиенте
Процедура Очистить(Команда)
	
	ЗаполнитьОбновитьГрафик(Истина);
	
КонецПроцедуры
